Tekla.Structures.Drawing.UI.DrawingObjectSelector
The DrawingObjectSelector class is used to select drawing objects in the drawing.
The class contains methods for selecting/unselecting single objects or
a list of objects. Currently, these selections both select the objects from the
database and highlight them visually.
In the following example, the lines in the drawing are selected first. The selection
is then extended with circles and finally all the selected objects in the drawing are
gotten.
using Tekla.Structures.Drawing;
using System;
using System.Collections;
public class Example
{
Drawing MyCurrentDrawing = new GADrawing();
DrawingHandler drawingHandler = new DrawingHandler();
ArrayList GetDrawingObjectsByType(Type objectType)
{
ArrayList ObjectsToBeSelected = new ArrayList();
foreach(DrawingObject drawingObject in MyCurrentDrawing.GetSheet().GetAllObjects())
{
if(drawingObject.GetType() == objectType)
{
ObjectsToBeSelected.Add(drawingObject);
}
}
return ObjectsToBeSelected;
}
public void Example1()
{
ArrayList MyLines = GetDrawingObjectsByType(typeof(Line));
if(MyLines.Count > 0)
{
drawingHandler.GetDrawingObjectSelector().SelectObjects(MyLines, false);
}
}
public void Example2()
{
ArrayList MyCircles = GetDrawingObjectsByType(typeof(Circle));
if(MyCircles.Count > 0)
{
drawingHandler.GetDrawingObjectSelector().SelectObjects(MyCircles, true);
}
}
public void Example3()
{
foreach(DrawingObject drawingObject in drawingHandler.GetDrawingObjectSelector().GetSelected())
{
if(drawingObject is Line)
{
Line line = drawingObject as Line;
// Do something with the line.
}
else if(drawingObject is Circle)
{
// Do something with the circle.
}
}
}
}

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectObject(Tekla.Structures.Drawing.DrawingObject)
Selects a single object in the drawing.
DrawingObject: The object to select.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectObjects(System.Collections.ArrayList,System.Boolean)
Selects the specified drawing objects in the drawing.
DrawingObjects: The drawing objects to be selected.
ExtendSelection: Defines whether the selector keeps the currently selected objects selected or not.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.UnselectObject(Tekla.Structures.Drawing.DrawingObject)
Unselects a drawing object.
DrawingObject: The drawing object to be unselected.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.UnselectObjects(System.Collections.ArrayList)
Unselects the specified drawing objects keeping the other objects still selected.
DrawingObjects: The drawing objects to be unselected.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.UnselectAllObjects
Unselects all the selected objects.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.GetSelected
Gets the selected objects in the drawing.
Returns: A drawing object enumerator of the selected objects in the drawing.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectObjects(System.Collections.ArrayList,System.Boolean,System.Boolean)
Selects the specified drawing objects in the drawing.
DrawingObjects: The drawing objects to be selected.
ExtendSelection: Defines whether the selector keeps the currently selected objects selected or not.
SuppressCallbacks: if set to true, suppress callbacks.
Returns: True if succeeded.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.GetSelectedAnnotation
Gets the selected objects in the drawing.
Returns: A drawing object enumerator of the selected objects in the drawing.

Tekla.Structures.Drawing.UI.DrawingObjectSelector.SelectObjectsWithHighLight(System.Collections.ArrayList,System.Boolean)
Selects the specified drawing objects in the drawing and highlights them strongly
DrawingObjects: The drawing objects to be selected.
ExtendSelection: Defines whether the selector keeps the currently selected objects selected or not.
Returns: True if succeeded.